Revit 2027 API
SelectionFilterElement.Contains Method
 Returns true if the given ElementId is a member of this filter's set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Contains(
	ElementId id
)
Public Function Contains (
	id As ElementId
) As Boolean
public:
bool Contains(
	ElementId^ id
)
member Contains :
        id : ElementId -> bool
Parameters
id ElementId
 The ElementId to look for.
Return Value
Boolean
 True if the given ElementId is a member of the filter, otherwise false.
Exceptions
Exception | Condition
ArgumentException |  Invalid ElementId
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SelectionFilterElement Class
Autodesk.Revit.DB Namespace